{
    "Naeleck": "If you still haven’t heard of Naeleck yet, you will soon. The French DJ and producer is on a red hot path to take over the world with his trademark explosion of melodic EDM, heavy bass, and hardstyle beats. <br /><br />With over 300 million streams across digital platforms, one thing is clear, fans can’t get enough of this masked undead cult figure who’s blurring the lines of music, anime and the gaming world to create a one-of-a-kind audiovisual experience. <br /><br />The last couple of years has seen his popularity grow to insane levels, reaching#74 on the coveted DJ Mag’s Top 100 DJs of 2022 – making him the 3rd top French DJ after David Guetta and DJ Snake.<br /><br />On the decks, he’s played at the biggest festivals and clubs across Europe, Asia, Oceania and North America. Away from the decks, he’s simply an enigma. Last seen on top of a skyscraper in Tokyo, in the catacombs of Paris, or a cave in Southern Asia. The rumors are endless.<br /><br />Beyond his music, Naeleck has created an entire universe based around his undead character with 50 million views on his genre-bending videos on Tik Tok and over a billion views on his GIF stickers – striking a chord with everyone from French youth culture to A-list Hollywood stars.",
    "Lektrique": "Lektrique is a Belgian born artist, now based in LA. His music can be described as a blend of electro house and bass, displayed on stage with high energy. The DJ has already released some amazing and successful singles such as “Omega” or “Shred”. <br /><br />These achievements lead him to be supported by many artists like David Guetta, Afrojack or Excision. So, Lektrique leaves an original footprint on the electronic music environment. ",
    "Walschlager": "",
    "Brave The Storm": "Brave The Storm is a Denver-based artist whose art defies categorization while pushing the boundaries of audio-visual immersion. Exploring themes of chaos and resilience, Brave The Storm fearlessly delves into the depths of human emotion; celebrating life's peaks, navigating its valleys, and traversing the realms in between. Inspired by the vision to spark a new hope for the future and inspire the drive to build it, Brave The Storm is the sound of a turning tide.",
    "Vacult": "Jeremy Williams, aka VACULT, began his musical journey by teaching himself classical guitar at 13. By high school, he found a passion for action sports cinematography and later attended the University of Oregon film studies program. After a few years of making films based around free-ride mountain biking, Jeremy decided to put his passion for creating music first and foremost. Combining moody cinematic breaks, hard-hitting bass lines, and unique, catchy top lines centered around dark, horror-filled forests. He is using the VACULT project to carve out a new subgenre coined Cult House. Amongst a series of self-releases, he has released tracks on labels such as Elevate the Soul Electric Hawk, and Disguised Collective. As well as official remixes for SWARM, TINYKVT, and Jay Dunham.",
    "Virzient": "By combining folk music with popular EDM genres, the music of @Virzient gives a feeling of communion and adventure in a world of darkness and despair.",
    "Bombs Away": "The Bombs Away experience is a blend of club classics, pop culture references, exclusive customs remixes and hype vocals. Initially as a duo, Bombs Away grew a big fanbase and has been liked by many artists such as David Guetta, Timmy Trumpet, Tiestö, Afrojack or Plastik Funk. Tommy rides alone since 2021 and he has delivered many iconic and high-energy tracks that have been streamed a billion of times. If you don’t know about Bombs Away, you will with “Monster” for sure ! ",
    "Skan": "Skan is a Music Producer inspired by his pianist father, embarking on his music career to create infectious and emotionally resonant tunes. Despite starting only a few years ago, he's gained significant recognition with over 200 million Spotify streams. <br /><br />Skan values strong relationships with collaborators and fans, which fuel his creativity and drive his growing success. With big dreams and relentless energy, he aims to influence the world and expand his audience with more original music.",
    "Krale": "Krale (Vincent Suddaby) is a Montreal based multi-genre music producer and composer. Always evolving and trying new things, he presents a versatile catalog of music ranging from cinematic soundscapes and compositions, to hard hitting EDM tracks and hip hop credits. His music has amassed millions of streams worldwide, and his orchestral work has been featured in notable productions such as \"Black Mirror\" on Netflix. Considering his varied portfolio, Krale's musical style can be hard to define, but his distinct melodic footprint is always present in his music.",
    "Veronica Bravo": "Veronica Bravo is a singer, pianist and songwriter from Perth, Western Australia, and has been writing since the age of 15. Following her success on 2012 XFactor, Veronica moved to Los Angeles to pursue her music career. Now back in her home-town teaching, songwriting and performing, Veronica Bravo has been collaborating with producers and singers from around the globe and has performed both internationally and locally. Hitting 1.3 million monthly listeners currently and over 100 million streams across music platforms the young singer has built a name for herself in the electronic music industry. Veronica’s powerful and emotional vocals appear mostly on EDM, trap, pop and future bass music however can strip it back and perform acoustically with just her and the piano. Since moving back to Perth, Veronica has made a name for herself and has teamed up with her talented partner to form the pop/electronic duo, Indigo Hearts. Captivating by her presence on stage, Veronica Bravo sure knows how to connect with a crowd and add her own unique style & sound to any song.",
    "Drama B": "Meet Drama B, the Bronx-born visionary shaping the music scene with his soul-stirring beats and lyrics. Armed with a degree in Digital Media Arts from Touro College, Drama B's journey began with an internship at Lounge Studios. His tracks have made waves globally, landing placements on popular TV shows and earning nods from sports leagues like the MLS and NBA. Beyond music, Drama B sees his art as a tool for unity and positivity, using his platform to spread messages of hope. From the 2016 Olympics to major label collaborations, Drama B's impact is felt far and wide in the industry.",
    "Mariana BO": "Mariana Bo is a Mexican DJane, producer and violinist. Her skyrocketing career has already brought her to places. Indeed, she is ranked as #43 in DJ Mag Top 100 and #8 in DJANE Top 100! Her sharp approach to music comes from a classical training in playing violin. She built up her musical style by mixing electro music and the sounds of this stringed instrument, creating a very unique style in the industry. Supported by great names, such as Armin Van Buuren, KSHMR, she also collaborated on stage with famous DJs like Tiestö, David Guetta or W&W. Furthermore, her work has also been spotted by the public because her titles have been played millions of times on Spotify. Listen to her tracks, you’ll be Mariana-mazed! ",
    "LNY TNZ": "LNY TNZ, the Dutch Hard Dance and crossover sensation, captivates audiences worldwide as a DJ, producer and founder of his label, FVCK GENRES. Getting inspired by the love for putting a fresh twist on hard-hitting EDM, LNY TNZ lives by the motto ‘FVCK GENRES”. LNY TNZ is known for bridging the gap between Hard Dance and mainstream music. <br /><br />LNY TNZ has left his marks in the music industry with epic collaborations and remixes, teaming up with heavyweight artists such as Afrojack and David Guetta, Blasterjaxx, or Martin Garrix. LNY TNZ’s anthem “So Easy” with Da Tweekaz took the gaming world by storm, becoming the first-ever hardstyle track to be featured into the legendary battlefield of Fortnite, one of the world’s most popular video games in history.",
    "Dubscribe": "Dubscribe is a Japanese Dubstep producer.<br /><br />He has released music on big labels like Subsidia,Excision Music,DPMO,Buygore,Rottun, SMOG, Savage Society and more.<br /><br />His music has been played at big festivals around the world.<br /><br />He made 2 official Remixes for the top Dubstep producer Excision. <br /><br />and Dubscribe played at the world biggest Dubstep Festival Lost Lands 2022.",
    "The FifthGuys": "The FifthGuys is a duet coming from Italy. Over the years, they have built a strong bond thanks to their mutuel passion for music. The two friends developed their own style around future bass/trap music, using many instruments including guitars, basses and pianos. Ranked in the top 10 of italian electronic music streams, they sure have conquered masses. On Dancing Dead Records, they released many bangers such as “Back it up” (in collaboration with Coffreshop and Blvkstn), “Drop It Like It’s Hot (in collaboration with Cryjaxx and Justtjokay) and many more. And now they “Rise Up” again with us! ",
    "Chris Linton": "Who is Chris Linton? Well, more than 2 million people on Spotify (monthly) know the answer to this question. Coming from Plymouth, Linton has produced a lot of bangers, on his own and also in collaboration with many artists. His favorite styles are trap, dubstep and hardstyle. Chris has been noticed on TV, as he performed at “Tour de France” 2023 or “World Darts Championship” 2022. He also grew a big fanbase, as the amazing numbers of followers on his socials suggests. So the question is not “Who is Chris Linton ?”, but “What’s he going to do next”?",
    "RayRay": "This is not a ray of moonlight, this is RayRay! Coming from Taipei, she’s a multi-talented artist supported by the greatest such as Skrillex, Yellow Claw or Steve Aoki. As a producer, DJ, singer, rapper, RayRay shines bright on the scene and delivers high energy wherever she walks. She released many great tracks opening up the road to success. Her fans have seen her on the most famous stages in the world, such as Tomorrowland, Ultra Taiwan or Sunburn Festival. These performances have led her to be crowned 3rd of DJ Mag’s Best China Award and to be featured on 1001Tracklist’ “2023 future of dance”. And now? Be sure that 2024 will skyrocket her “To The Moon”. ",
    "Sihk": "Indonesia's premier Hard Dance DJ and producer -- has been making waves in the global electronic music scene. He's earned recognition as the Rising DJ of the Year in Indonesia and has been featured in prestigious festivals like Tomorrowland and EDC Mexico. In 2023 and 2024, he reached new heights with releases on labels like Dutch Master Works and Barong Family, as well as making his debut on Insomniac's Basscon label and Dancing Dead. His collaborations extend beyond music production, including co-producing hits for artists like Rich Brian and NIKI. With exciting projects, collaborations, and the recent signing to Corson Agency for North American representation, SIHK's international breakthrough is imminent.",
    "Mephi": "Mephi? That name sure rings a bell. Mephi’s dark soundscapes, always accompanied by powerful basslines, groovy percussion and other crazy elements, does not leave indifferent. Indeed, that’s how he gained support from great artists such as Don Diablo, Tommie Sunshine, Blasterjaxx and Valy Mo. <br /><br />You may have seen him in the biggest Japanese clubs (Tokyo) such as AgeHa, Warp, TK or Camelot. He also brought fire to many scenes in Lyon and Marseille. Furthermore, he has entered many contests such as Les 24H DE L’INSA (Lyon) and EDC Japan Discovery Project (2019), during which he reached the finals. <br /><br />These great achievements pushes him further and further. His goal is to share his musical vision to the masses. Follow his fantastic ascension and enjoy the Mephi experience!",
    "Luca Testa": "Meet Luca Testa! You sure have heard about tshe italian producer. Indeed, he has been ranked #123 in DJ Mag’s chart last year. <br /><br />Music struck him very young.  From a piano enthusiast, he turned into a successful DJ, performing on the best stages around the world. For sure, his one-of-kind vision touched the masses. In our opinion, 2024 will be his year! ",
    "Bonka": "The iconic Australian duo Bonka is exploding the dancefloors worldwide. Partying and making music are top-tiered priority for the two as they display their massive energy on the most famous stages. Lachlan et Connor are supported by Timmy Trumpet, Mariana Bo and The Chainsmokers. No wonder why when you listen to their thumping tracks! Popping up everywhere on big playlists and Billboard (4 times), these two really ignite the dance scene! ",
    "Kill the Clowns": "Kill The Clowns : what an incredible name for this duo of masked producers coming from Mexico! Their distinctive music and look have propelled them to the most famous festivals on the planet and catch the eyes and ears of Steve Aoki, David Guetta or Dimitri Vegas. New projects to come on 2024! Both clowns work with other major artists in order to deliver ",
    "Lockdown": "If you missed Lockdown, you won’t next time, because this Australian DJ does not go unnoticed. His music and his masked look are highly recognizable in the electronic landscape. Furthermore, his music has been played worldwide by famous DJs such as Timmy Trumpet, Steve Aoki, Nicky Romero and Afrojack, so if you’re not acquainted with the man, you have surely heard some of his tracks! He grew a big fanbase throughout the years and has been acclaimed in the world’s largest festivals and club stages. Nevertheless, the man behind the mask remains a mystery. It is said that this look was made mandatory by officials because the fire in his eye may be a major contributor to global warming. They’re not wrong because his music burns everything! ",
    "DJ Junior (TW)": "Junior is a famous DJ in Asia and perform in many world-known music festivals, hottest clubs in overseas and high-profile events. DJ Junior on the decks is serving up his signature mix of high energy, eclectic tunes. Junior start DJing at the age of 16 and was drawn to the profession through his love of music and the inspiration received by watching local and foreign djs’ ability to craft and customize music to a live audience. ",
    "Maikki": "Maikki is a talented artist originally performing and writing alternative rock songs, who decided to explore the electronic music soundscape a few years ago. She infuses rock and pop in her electro tracks, creating a unique EDM touch, inspiring masses throughout the globe. That’s how her tracks “Like it like that” and “Wasabi” brought a fresh impetus to her career.  She was featured as #1 in Beatport charts and gained massive support from Steve Aoki, Brennan Heart or Blasterjaxx. Furthermore, she performed on the best stages such as EDC Las Vegas, alone or with other big producers. Maikki is indeed a new rising star in EDM field. ",
    "Kozah": "You sure have heard Kozah’s tracks “Think of dreams” or “For Eternity” on Dancing Dead. This Greek artist delivers a unique sound, a fusion between different kinds of influences, such as film score music, ethnic melodies and live-played instruments. <br /><br />Coming from his inner core, transcending time and feelings, his creative and innovative soundscapes have already conquered many hearts. With more that 133K monthly listeners and support from artists such as San Holo and The Chainsmokers, Kozah’s music is a chest opening up to the realm of dreams. Unlock it by pressing play! ",
    "DJ Fluke": "It’s not the first time that DJ Fluke has trusted Dancing Dead Records in promoting and distributing his music. On the label, you sure have heard “Sweet Dreams”  “Never Enough” (1 million streams on Spotify) or his absolute banger “Seven Nation Army”, a skyrocketing track weighing 65 million streams on Spotify only. This last piece in particular has hit platinum, according to Le Centre National de La Musique in France, a major achievement that we wanted to underline here.<br /><br /> Born in Singapore, raised in Melbourne (Australia), Fluke founded his own business, TANG Events, a nightclub group. Furthermore, he leads a team of 30 DJs in the five most popular Australian clubs. In 2020, he launched his artist/producer career and his work has been noticed by many famous DJs such as Timmy Trumpet, Armin Van Buuren,  Like Mike or Blasterjaxx, who have supported him since. He’s touring all around the globe, so don’t miss your chance to see him on stage! ",
    "Highup": "Let’s introduce Highup! We’re sure that you already know his name, because his tracks are golden. His music can be characterized as the point of confluence between EDM and big room house, a fine balance he masters. Talking of golden stuff, Highup comes from Gold Coast in Australia, from where he infuses his work into the best clubs worldwide. His work has a sharp value as far as dance music is concerned and he has been supported by David Guetta, Martin Garrix, Dimitri Vegas or Timmy Trumpet, proving that he has a solid network on his side. <br /><br />Numbers speak in his favor as well, because he has compiled millions of streams on all platforms. This great success led him to perform on big stages, such as Ultra Music Festival and Luna Electric. His last release with DJ Soda “Memories” on Den Haku Records, confirms this huge tendency to drop bangers. ",
    "Julia Temos": "What about Julia Temos? This talented Australian artist has many strings to her bow : she is a writer, a producer and a singer. She used to work as a radio host and writer but now she’s focusing on her artistic career, sharing her multiple talents with her public. Her voice, which can be qualified powerhouse, has gathered approbation from huge names such as Tiestö, Dom Dolla or Danny Howard. Furthermore, she has been nominated on Future House Music Awards as best vocalist 2023. <br /><br />We feel that 2024 will be bright for this rising star. Follow her on her social media: don’t miss her ascension!",
    "Agent Zed": "Agent Zed is a time traveler on a secret mission. He is half human, half alien and his special mission is to travel back in time to identify the most popular hits from the 80s, 90s and 00s, dust them off and, in cooperation with DJs, producers and artists worldwide, give them a fresh, new sound with modern beats, clear melodies and brand new remixes and edits.",
    "RED SHORTS BOY": "Welcome to Red Shorts Boy’s pixelated world! Coming from La Réunion, a French island located in the Indian Ocean, next to South Africa, the producer and DJ explores EDM subgenres to create club and festival bangers. His track “Super Mario Bounce” has been played 400K so far. Will you press the button too? Actually, it’s possible. You can incarnate Red Shorts Boy in a vintage style video game created for the release of his first EP “Pixel Run”. Now, discover “Flyman”, the new track produced by the DJ and float on electro house wings. ",
    "MSPUIYI": "MsPuiyi is a malaysian DJ, artist, producer, singer, influencer, actress… Her multi-talented personality shines all over the world! She has been featured in many magazines, movies, TV shows and has collaborated with many brands such as Ulike, Kardinal Stick, or Asics… <br /><br />She is also a great DJ, that has been recognized two times this year on DJANE TOP : #13 on Asia’s list and #2 on Malaysia’s list ! She has toured in 10 countries and mixed with Wolf Pack, Mr Black and Marc Vedo. Her music has a lot of impact on the industry as she is a passionate producer shining all over the industry. She indeed collaborated with many famous names, such as Gammer, Naeleck and Goldfish. Where is she going next? Follow her, because she’s full of surprises.",
    "Krimsonn": "Krimsonn is a Salvadoran born DJ, currently living in Canada. His unique sound is a blend of swing, jazz, disco, funk and dance music. He is also a skilled songwriter : he signs all of his toplines and lyrics. <br /><br />His glowing vibe has been spreading on the industry leading him to be released on the biggest record labels in the dance music scene, such as Furthermore and Dharma Worldwide. And online, he gathered 3 million streams on Spotify. We can already tell that his future is bright, don’t you think? ",
    "DJ Shadow Dubai": "Last but not least : DJ Shadow Dubaï ! This Bollywood superstar wishes for Indian music to spread to larger audiences. In this perspective, he collaborated with many major artists such as Sean Paul or Pitbull. Reaching 150 million views on Youtube and attracting a massive audience in the first 24 hours of its release, his track “Slowly Slowly” placed him on the sunny spot. <br /><br />His sharp sense of music led him to become a music producer. He is now mastering the art of remixing. Furthermore, he sparkles on the most famous stages worldwide (Asia, America, Australia and Africa). It’s rare to be told but his name has been dropped in the Guinness Book Of Records because of his participation in the World's Biggest DJ Rally!<br /><br />DJ Shadow thinks that collaborations are the way forward to uniting the world through music as well as the route to taking Indian music to a global audience. ",
    "kyootbot": "Kyootbot is a streamer, a social media creator and a singer. Her hardworking and curious nature has led her to many places, as she shares and talk with people live. Her community has grown a lot. For instance, her cringe worthy dating and chatting format is followed by an increasing number of fans at each episode. She is wandering now through the spaces of music. Her future is bright, keep an eye on her work ! ",
    "TANKYU": "",
    "Micah Martin": "We’re sure you already heard Micah Martin’s voice ! In addition to his work with his rock’n’roll band, The Zealots, his songs are often played during sessions of your favorite games (Fortnite, Rocket League…). This talented vocalist has worked with many artists such as Don Diablo, Zomboy, Black Tiger Sex Machine, Crystal Skies… The list is far from exhaustive. ",
    "22Bullets": "22 Bullets is a thai artist coming from Bangkok. He is known for his strong dance touch and has been recognized by the most famous DJs worldwide like  Afrojack, Vinai or Showtek, some of <br /><br />which he has performed with on stage. His work has been released on different major labels such as Spinning Records, Musical Freedom or Warner Music. Last year, DJ Mag distinguished the man as Top 83 of the best DJ in the world ! On top of that, his hit “It isn’t me” has been viewed 536K times on Youtube. That’s huge, isn’t it ? ",
    "Dimatik": "Dimatik is supported by Armin Van Buuren, Tiësto and Hardwell. His tracks have been released under different labels such as Dharma, Spinnin’ Records, Smash The House… His most famous track, “Punjabi”, in collaboration with Timmy Trumpet is a psy / hardstyle anthem that convinced 80 millions of listeners on Youtube ! ",
    "Technikore": "Technikore comes from the UK. His name has been seen on many different stages across the world. With his friend and music partner, JTS, he runs the hardcore brand OneSeventy, a record label and club event in Sydney. This DJ has a unique style, blending classic Hardcore elements with modern production techniques.  ",
    "Jay Eskar": "Jay has already released eight albums under different labels (NCS, Universal Music, Sony Music…) and has always been attracted to music and especially to the production process. Well known for his sense of detail and desire to provide a unique sound characterized by intricate melodies, driving basslines and creative percussions, Eskar is the new face of the Mexican electronic scene, juggling with different styles : a whole spiritual and emotional odyssey. ",
    "ILSE": "Ilse’s world is also filled with an emotive vibe, brought to you through her enchanting voice and songwriting. She has released a few singles (in collaboration with Harmor Records, Madox Records…) displaying her delicate soundscape, combining pop, EDM and dance together. Furthermore, Ilse shares her vocal talent with her followers on social media, into short enticing videos. ",
    "Smitech Wesson": "",
    "Gammer": "Whether you fell in love with him when he established himself as a leader in UK hardcore or when he created one of the most iconic dubstep tracks in recent years, Gammer is an artist you simply can't miss. Self-proclaimed as the man who \"did that one song that accidentally got big\" when he released \"The Drop,\" quite the contrary is true: Gammer's expansive music catalog speaks loudly for itself, and his career continues to contain multitudes.<br /><br />Branching out to the many styles of dance music, Gammer made a new name for himself as he experimented with genres such as dubstep and trap, attracting a new generation of listeners. By 2017, Gammer was a household name on the leading electronic imprint Monstercat. In 2018, Gammer unleashed an aptly-titled single that would become the most-played track at EDC Las Vegas 2018 and a future classic: \"The Drop\" boasts nearly 20 million global streams and manages to make any crowd erupt upon its legendary drop. From that moment on, Gammer welcomed the scene's next generation and continues to deliver genre-bending music formed by the many lives he's lived in the scene.<br /><br />Revered for his musical versatility and high-energy DJ sets, Gammer is a staple at some of the world's biggest music festivals, including Tomorrowland, EDC, Ultra Music Festival, and many more. Gammer's addictive sound has brought him to the furthest corners of the world.<br /><br />As a storied producer, celebrated DJ, and a powerful trendsetter, there's no one quite like Gammer.",
    "Dougal": "",
    "Cyberpunkers": "The Cyberpunkers, in their own way, have captured what Cyberpunk is in the modern era.Through their performances at highly produced clubs & festivals around the globe, they’ve become an international name, one which has helped define the crossover between contemporary sounds and an unforgiving, upfront musical mentality. All their music is produced entirely by them in their studio in Milan (IT) from sound design to production until finalization. Their identities are hidden through a masked look which they've donned since the beginning.This is gave them a unique style, something that is a fundamental part of each one of their sonic offerings.The originality of their shows is also a stand out part of their dynamic, with the use of two consoles at once,powered by several audio machines, captivating people over an era.",
    "Don Darrell": "",
    "Yung Diggerz": "Originally from France, Yung Diggerz is a young DJ producer of Electronic Music, hybrid ambiancer, scenically impulsive and outstanding mix/scratch technician.<br /><br />Signed on the DANCING DEAD RECORDS, BRODERSKAB MUSIC and SIDEKICK MUSIC, he has accumulated millions of plays on Spotify, in particular thanks to his album \"Changes\" released in 2018. Very active musically, he never ceases to surprise with his creativity and musical eclecticism.<br /><br />Noticed by big names such as DJ SNAKE, MERCER, Dj LBR and NAELECK, he also received support from famous electronic music blogs like YourEDM.com & EDM.com.<br /><br />Inspired by Diplo, Skrillex, Major Lazer and Daft Punk, he gradually carved out a place for himself in the electronic music industry. He describes his music as an eclectic mix of chilled, edgy underground sounds with warmer, more rhythmic harmonies, impressively dabbling in several subgenres such as Dubstep, Bass House, Trap and Moombahton.<br /><br />In 2020 he created his own label \"Changes Music Entertainment\" with 6 tracks to date including \"Don't Start\" in collaboration with BIG ALI.<br /><br />Hard worker, exceeding his limits both in production and live, by creating 3 evening concepts that will take you to different musical universes that have contributed to building his artistic identity.",
    "RANKZ": "Experimental bass producer from Los Angeles California.",
    "KOWZ": "KOWZ, a duo of French producer, lover of Bass Music. Their style is rich and varied and sweeps cheerfully the spectrum of the Bass Music, by insufflating some sonorities coming from the classical and orchestral repertory to it.",
    "Cabuizee": "Michael Jared Caabay, also known as DJ/Producer CABUIZEE, achieved international success with his remix of Bruno Mars' \"That's What I Like,\" reaching the US Billboard top 3 for remixes. He was honored as the \"2018 Heart Remixer of the Year.\" This accomplishment attracted other renowned artists, including Zedd, Slushii, Diplo, and The Chainsmokers, to showcase his work in their podcasts, blogs, and mixes.<br /><br />Cabuizee's undeniable talent is evident in his music, which has garnered over 60 million plays collectively. He has signed his original work with labels such as Warner Music, Interscope, Dim Mak, Dancing Dead, Magic Music, Loudkult, Tribal Trap, and more, with additional collaborations currently in progress.<br /><br />To date, Cabuizee has played, opened, and closed for notable DJs like Jauz, Zeds Dead, Joyryde, and Slumberjack at various private, underground events, and renowned venues such as Electric Fairytale Festival, SXSW 2019, ACEN anime convention (with over 4000 attendees), 1015 Folsom, Ruby Skye, Origin SF, Torrent NightClub Maryland, and many more. With an unyielding passion to deliver the most creative and innovative music, combined with his proven and undeniable talent, the sky is truly the limit for this fast-rising star.",
    "undy": "Sarah Underwood (undy) is a bilingual Nashville & LA-based writer/vocalist specializing in image-driven lyrics, syncopated rhythms, and emotive, conversational vocals. Over the past couple years, she has written with hundreds of up-and-coming artists and producers, amassing over 65 cuts and building a buzz for herself as young Nashville’s go-to pop lyricist. Underwood has been dubbed “one to watch” (NSAI) and was included in ASCAP LA’s recent “Poised to Break” class.",
    "Cartoon": "Cartoon formed in 2015, gluing together 3 of Estonia’s craziest songwriters & producers. Taking influences from classic drum & bass, stadium EDM & pop with a capital ‘P’ they've managed to amass over a billion streams across all platforms combined. While the trends of music may change with the times, drum'n'bass will always remain at the heart of Cartoon. ",
    "Jéja": "JÉJA has managed to amass billions of streams across all platforms combined. His hit record 'On & On' was awarded the RIAA gold certification in the United States. As a 'producer for hire' he has also worked on multiple Billboard charting albums, with artists such as 5 Seconds Of Summer, Trey Songz, Sleeping With Sirens, The Used and others. Bios are boring, go listen to music.",
    "Elina Born": "Estonian singer-songwriter Elina Born was first noticed from the local Idols TV show, with her unique voice and talent. In 2015 Elina represented Estonia at the Eurovision Song Contest in Vienna, Austria with Stig Rästa. 2018 brought Elina a signing with Universal Music Estonia and ever since the popstar has been producing hits and shining on the stages.",
    "Fukkk Offf": "Fukkk Offf aka Bastian Heerhorst has been renowned for some time in his hometown for storming live sets in the clubs scattered around Hamburg's red light district. \"Die sündige Meile\" or \"the sinful mile\" as it is known has seen its walls shaked and thighs quaked by the throbbing depths of Bastian's big room Fukkk Offf Sound. Many a night you would witness the frustration on the faces of lonely old men as they realized that the brothels were empty. All the girls would no doubt be down at the club shaking their money makers to the sounds of our young hero. These same streets are where the Beatles made their way in the early 60s. John Lennon was once quoted as saying \"I might have been born in Liverpool, but I grew up in Hamburg.\" The word traveled, as it does when you have a sound as un-containable as this. Ears perked up all over the world to this fresh & irreverent youth. Bastian was contacted immediately by the heads at Coco Machete Records in New York City. Having heard of the exploits, of the girls in this northern port dressed up in skiing outfits, going wild to his sounds and ignoring their nights work, the contact was made.",
    "Haezer": "Ebenhaezer started his music career under the alias 'HAEZER, reaching over 5 million plays on Spotify alone. With a Cannes Lion award for his music video 'Minted', song placement on the Need for Speed: Rivals game, song feature on Steve Aoki's BBC essential mix, fifteen international DJ tours and a Webster Hall performance in New York city, Ebenhaezer has expanded into music and sound design for film, tv and games. He now focuses on producing dance music for the same reason as when he started...Fun",
    "aUtOdiDakT": "Basic Bangers. Bass for days. Kaputtraven. Genres are dead.",
    "Bellorum": "",
    "Heavygrinder": "HEAVYGRINDER have transformed themselves time and again throughout dance music’s constant evolution, working their love for Heavy Metal, Anime, J-Pop and EDM into dozens of releases, including official remixes for Thy Art Is Murder and DJ Bl3nd, several collaborations with chart-topping Japanese band GARNiDELiA out on Sony Music Japan, and original EPs which consistently feature on Beatport and iTunes charts.<br /><br />They single-handedly pioneered the Metal Electro genre – which has since gained widespread popularity – by being the first to remix songs such as Cannibal Corpse's \"Demented Aggression\", Pantera's \"Walk\", Slipknot's \"Wait and Bleed\" and Tool's \"Forty Six & 2\" in a contemporary EDM fashion.<br /><br />Based in Los Angeles, their career and fans have taken over the globe, with HEAVYGRINDER performing at prestigious festivals such as EDC, Coachella and Anime Expo, as well as touring the United States, Asia and Europe",
    "KATFYR": "KATFYR is a music producer and DJ from Los Angeles, California.<br /><br />Known for his signature mix of energetic beats, powerful synths, chip-tune motifs, and engaging melodies, KATFYR’s music has gathered a loyal worldwide fan base.<br /><br />He’s performed throughout Europe, US and Japan alongside Skrillex, Porter Robinson, Crystal Castles, Designer Drugs and Wolfpack, and his music is a regular presence in Beatport charts, with both “Lose Control” and “Coffee Time” making it to the number 1 spot of the Top 100.<br /><br />In 2018, KATFYR produced an official remix for Koda Kumi’s hit single “PARTY” which was released as part of her Driving Hit’s 8 remix album, and has been used by the J-Pop singer as an opener for her live performances. This was followed by 4 more official remixes in 2019 and 2020, this time for “WATCH OUT”, “EH YO”, “DO ME” and “Guess Who Is Back”, the latter being one of her most played tracks on Spotify with over 1.5 million streams. More recently, KATFYR has produced the single \"Lean Back\" for DAPUMP, one of the biggest Japanese boy bands of all time.",
    "Ögenix": "",
    "Kløn": "Get ready to experience the pulse-pounding beats of Klon, the dynamic artist duo are taking the music world by storm! Hailing from Belgium, this pair of best friends have amassed an astounding 30 million streams on Spotify alone. Klon are mostly known for their Trap influenced sound but recently also have been making some waves in the House and Phonk scene. It is clear the Belgians aren't afraid to experiment with some new genres.<br /><br />With releases on an impressive array of labels, including Lowly, Chillyourmind, Panthers Groove, Magic Music, Blanco y Negro and more, Klen is quickly becoming a household name in the industry. But it's their epic remix of 'Toss a Coin to your Witcher' that truly put them on the map, racking up over 7 million streams! With 2022 being a banner year for the duo, Klon are releasing even more mind-blowing music this year.<br /><br />Don't miss your chance to see them live! Bookings and inquiries can be made through gust@moonsociety.be.<br /><br />And be sure to check out the amazing photos by Alex Benes @Photomyth.",
    "Becko": "Becko, also known as the singer of the band xo sad is a multi-genre vocalist that has reached millions of listeners over the past few years with his wide range of vocals and high output of quality music. ",
    "Overdrive": "OverDrive is a hardstyle duo consisting of two producers who have a decade of experience and have developed a unique and powerful sound that is characterised by its high energy melodies and hard hitting kicks .Their music is known for its intense and electrifying energy, as well as its ability to get people moving on the dance floor. The duo has released several singles  bootlegs, remixes, and have performed at major festivals and events around Australia. They have a dedicated fanbase and are known for their high-energy live performances. OverDrive continues to push the boundaries of hardstyle music and are considered one of the most exciting and innovative acts in Aussie Hardstyle.",
    "Und3rsound": "Phil and Gabriele aka Und3rsound, formed in 2015. A year later they were supported by Timmy Trumpet at Tomorrowland. Und3rsound continued to perfect their own distinct music style. In 2022, they released on Cinematik Recordings for \"My Mother Told Me\" (w/ Dimatik), which has exceeded one million streams to date.",   
    "MahyaaR": "Mahyar Poursahebi AKA MahyaaR is a 21 years old self taught music producer from Iran. He started learning piano/keyboard when he was 11 and started making music a year after.he is mainly Genre-less as he makes music from EDM to Orchestral and Jazz.",
    "Reigan": "",
    "G4BBA": "G4BBA, He is one of the promises and new blood of the national electronic scene, with a powerful style he has been part of the most important lineups of the Mexican Republic.<br /><br />His consolidation was in the 2015 edition of Electronic Neon Fest (Puebla, Mex - 5k Fans) and in 2016 Electronic Dammove Fest (CDMX - 17k Fans).<br /><br />His track with Zoofunktion And Fito Silva \"El Morro\", which has been supported by Hardwell (Wold #1 DJ In 2013 - 2015) Deorro (Pandafunk), Blasterjaxx (Revelead Recs) and many others.<br /><br />He has put his personal style in official remixes for figures like : Yolanda Be Cool, Sak Noel, Tara McDonald, Mauro Picotto, Marsal Ventura, INNA, Alexandra Stan and many others. This confirms the confidence of great exponents in his skills as a producer. <br /><br />In November 2016, G4BBA was part of the lineup of the first edition of Daydream Festival Mexico, where I shared the stage with artists such as: Brennan Heart, Code Black, DJ ISAAC, Audiotricz, LNY TNZ, Dirt Caps, Cesqeaux, Mike Cervello, Noizilla, among others.<br /><br />In March 2018, G4BBA was part of the lineup of the first edition of Medusa Festival Mexico, where I shared the stage with artists such as:<br /><br />Alesso, Timmy Trumpet, Wiwek, Crisis Era, Mike Cervello, Mighty Fools, Juyen Sebulba, Dolf among others.<br /><br />In the last 2 years G4BBA has been supported from Top Djs Like: KSHMR, Deorro, Will Sparks, Mariana Bo & Blasterjaxx",
    "Salvo": "Named as one of NCS's top female artists to watch, Salvo emerges as a beacon of sonic transcendence in the world of electronic music. Not only a singer songwriter and DJ, she is an architect of merging ethereal with hard hitting bass music. Starting her journey in 2017 as a top line writer and featured singer, she has been guided by an insatiable desire to explore the complexities of the human experience. With her poignant lyrics and evocative vocal melodies, She creates narratives that delve into the realms of spirituality, channeling her creative energy into compositions that serve as conduits for awakening. Her performances, which combine her love of the decks and singing live on stage, are empowering experiences for the audience.<br /><br />\"I want my music to bring listeners to a place where dark and light, dreams and reality converge... where the listener can truly feel like the main character of their story, heal and learn about themselves along the way.\"",
    "AARMO": "AARMO is a young and talented music producer and DJ based in Italy. He has released on the most important labels in the electronic music industry under the name of \"Invisible\", a new project is now starting bringing a more particular sound such as HEXAGON, Soave, Magic Music, Zero Cool, Dancing Dead and many more.",
    "Menso": "Originally from Mulhouse, FRANCE, Menso is a music producer. He has been inspired and driven by electronic music since high-school, where his adventure has begun. Over the last few years, he has signed on several labels such as Sans Merci, Noir sur Blanc, Don't Sleep, Méchant Garçon... He also resident DJ of \"La Bergerie\" in La plagne and has played on some stages like \"La Karriere festival\" etc... <br /><br /> Menso is also supported by many artists/labels/media such as Axtone, Chris Willsman, Tony Romera, Eddwould, Austin Kramer, Spinnin Records, Guettapen and many more,...",
    "Molly Johnston": "Known as one of Canada's greatest voices, award-winning jazz vocalist Molly Johnson is a mother, singer-songwriter, artist and philanthropist, who has just released her highly anticipated new album, \"Meaning To Tell Ya\". Produced by multiple GRAMMY Award-winning Producer, Larry Klein (Joni Mitchell, Tracy Chapman, Madeleine Peyroux, Melody Gardot, Norah Jones); it is more than a jazz record. It's funk, it's soul, it's groove played by some of Canada's best musicians. Says Molly: \"Working with Larry was magic. When it was finally my turn, I jumped at the opportunity. This is a record I have been wanting to make for years. I can't wait to share it with everyone!\" Says Larry: \"Molly has the kind of musical gift that cannot be cultivated by musical education or assiduous practice. She has great natural musical instincts and an irresistible signature to her voice. She is a rare and wonderful talent.\"<br /><br />Dedicated to supporting communities in need, Molly established the Kumbaya Foundation and Festival in 1992, raising awareness and funds for people living with HIV/AIDS, and continues to work with several other charitable organizations each year. Molly has been awarded the Queen's Jubilee medal and in 2008, was honoured with becoming an Officer of The Order Of Canada (O.C.). This rare distinction was given to Molly to recognize her philanthropic work for a variety of causes and for her international contributions to the arts.",
    "NEZZY": "22 yo french musician: guitars, piano, deejaying & more. making Electronic Pop Music. already released tracks on Loudkult, Armada, Trap Nation, Soave, Dancing Dead, NCS, SANS MERCI, etc... influenced by San Holo & Kasbo. check out my debut album 'the walk', I released it for my 20th b-day (june 2021). official remixes for Kimotion, Tez Cadey, Alessiah, Antoine Chambe. latest collabs with US singers Seth Shimp & Leila Pari. lots more to come!",
    "Karra": "KARRA is an acclaimed artist, songwriter, and vocal producer. She is widely known for her top selling vocal sample packs on Splice with millions of downloads, as well as her collaborations with some of the biggest Dj/Producers in the industry. Her music has amassed over 1.7 Billion streams worldwide, and has accumulated over 350,000 fans across all social platforms. KARRA has made a name for herself through her educational yet entertaining content documenting her creative process, career, and life. This led to the creation and success of iamkarra.com, where she sells tools for music creators to assist them in honing in their craft, and finding their signature sound.",
    "Wasiu": "Featured on XXL, Billboard, NOISEY, VICE, Complex, The FADER, Hot97, ICITOUT.TV, Radio-Canada, Paul Arcand, ELEVATOR, Trap Nation, FoxSports, and many other platforms.<br /><br />Collaborations with Kaytranada, Apashe, Egzod, Besomorph, braev, Dear Lola, High Klassified, Da-P, Tommy Kruise, Dead Obies, Lary Kidd, and many others.<br /><br />Appears on: Kijiji Raps, Subway Wraps, Samsung S9 x T Mobile, Turkcell, NBA Playoffs 2019 Commercial, League of Legends 2019 Worlds, HBO's Succession, and many more.<br /><br />Address me, Your Majesty",
    "Coone": "From a young age, Coone has been mesmerized by music in all its different shapes and forms. The creation of his successful label Dirty Workz was a huge step in this young man's carreer, allowing him to take his music beyond even his own expectations and also giving new talents within the Hard Dance scene a respectable platform to launch new and exciting sounds into the scene. By the age of 24, Coone was able to lay down an almost impossible feat; completely selling out one of Belgium's largest venues with over 10.000 Hard Dance fans for an exclusive event - Coone And The Gang. As collaborations with some of Hardstyle's biggest names rolled in, Coone was able to impress the world with his unique sound within Hardstyle, imprinting a distinct signature sound into his productions. His experience has lead him towards a new challenge to create an album in 30 days including collaborations with some of the Hard Dance scene's superstars. The album was met with great support in the scene, catapulting Coone to new heights. Coone's success within Europe has opened up many doors for him as his eyes are fixed on the horizon, towards the international Hardstyle scene in countries such as Australia, Asia and the United States. Without a doubt, Coone lives and breathes Hardstyle. His passion shared by thousands of like-minded souls all over the world, each speaking a universal language. Music. A binding force uniting us all.",
    "Oddity": "",
    "MØRFI": "MORFI (Mikhail Pavliy) is the Thailand = based enigmatic music<br /><br />producer captivating the global scene with his spellbinding sounds.<br /><br />Hailing from a world where sonic landscapes come alive, this visionary artist has taken the music industry by storm, leaving audiences in awe of his remarkable skills.",
    "ladycryface": "",
    "WOLFHOWL": "Juan José Linés, best known as Wolfhowl is a 26 year old DJ and producer from Valencia, Spain. He began his music career in 2015, when he started playing some shows around the country. After a few months, he decided to focus as well on the music production besides playing.<br /><br />Since then he has released an official remix on Circus Records for the world known Flux Pavilion & his first released track \"You Know\" has reached millions of streams and has being posted on curated Spotify<br /><br />EDM Playlists as \"Night Rider\" making these as milestones on his early beginnings.<br /><br />With songs like \"One Last Time\" released with Sony Music, and his newest track \"Daylight\" coming via NCS he plans to convey his feelings through his music to reach as many people as possible and make them really feel his creations.",
    "NLCK": "Harder side of Naeleck",
    "Bedwetters": "",
    "Raddix": "Raddix is a (Austin, Texas) based producer and vocalist specializing in various genres including pop, trap, hip hop and several variations of Electronic Dance Music.<br /><br />In 2023 Raddix was inducted into the Grammys/ Recording Academy as part of the new member class. Raddix Impressively became a Grammys member before the age of 30, cementing his legacy in the music and entertainment industry. Raddix is also a mentor for Grammy U students, teaching some of the biggest artists from across the United States. Raddix was also featured as iHeart radios Top 12 indie artists of 2023.<br /><br />Raddix has become vastly popular across many locations around the world, reaching 175 countries with over 3 million streams exclusively on the Spotify platform in 2023.<br /><br />Raddix has had several notable live performances including Lost Lands 2022, Dancefestopia 2019 & 2022, Freakfest 2019, Foam Wonderland 2017 & 2022, Backwoods 2023,Sound of summer music festival 2019, Loudfest 2022, Electric Arts Fest 2022, Electric Retreat 2021 & 2022 and many more.<br /><br />The Raddix brand has performed on the same stages with and is in association with superstar performers around the globe, including Trey Songz, Tyga, Steve Aoki, Illenium, Slander,Chief keef, Flux Pavilion, NLE Choppa, Dej Loaf, Lil Flip, Arius, Cazzette, Deorro, Rusko, Riff Raff, 24 HRS, Kayzo, PnB Rock, Crizzly, YBN Nahmir, Trivecta, Bailo Bonnie X Clyde, Subtronics, and tons more!",
    "Diana Inez": "EDM Singer/Songwriter/Overthinker/Jumping to conclusioner living in LA, writing about my never ending intrusive thoughts!",
    "DiFi": "Born in Italy in 2001, DiFi began to approach the world of music as a child, starting to play the piano. His passion for music has accompanied him over the years, and he began producing EDM in 2013.<br /><br />In his productions, electronic music takes on different styles, in which EDM meets multi-genre influences in an innovative way. Everything revolves especially around the various nuances of House music, but despite the variety, all his productions share the constant search to convey the greatest amount of feelings to the greatest number of people.",
    "Invisible": "",
    "Spektrum": "SPEKTRUM is an electronic Music Producer & DJ based in Luxembourg. After touring internationally as a DJ for over a decade, Spektrum launched his project in 2017 to showcase his talents as an Artist. He quickly amassed over 30 million Streams across all platforms and has garnered support by International Artists like: Jauz, Valentino Khan, Zeds Dead, Yellow Claw, Kayzo at major EDM festivals like EDC Las Vegas, Hard Summer, Creamfields as well as on Sirius XM and BBC Radio1.",
    "Haley Reinhart": "A timeless voice outlasts eras. It also resounds louder as time goes on.<br /><br />Haley Reinhart brandishes such a voice. The expansive scope of her range comes into full focus on her 2019 album, Lo-Fi Soul. Mom & dad led their band, \"Midnight,\" and unsurprisingly, their daughter would sing before she could talk. The platinum-certified Chicago born & LA based singer/songwriter exudes an empowering level of charisma and skill earned by a decade long grind. She landed 3rd place & became a fan favorite on S10 of American Idol. Since then, her dynamic presence powered four solo albums- Listen Up!, Better, What's That Sound?, & Lo-Fi Soul. She's left her mark on commercials singing in the new Mazda ad, to Gossip Girl, Riverdale, Extra Gum, & the list goes on. Her take on Elvis Presley's, \"Can't Help Falling In Love,\" received a Gold plaque from RIAA, generating over 212M Spotify streams, won a Cannes & a Clio Award for the song in 2016. As a sought after talent, she stands out with Post Modern Jukebox's highest viewed video's, a la \"Creep.\" She dueted with Jeff Goldblum on two tracks from his chart topping jazz standards album. She continued pushing boundaries by singing & writing Vicetone's dance hit, \"Something Strange.\" She also voices a young boy named Bill Murphy on NETFLIX's hit animated series F Is For Family, season four coming out this summer. 2020 includes headline tours across the U.S.<br /><br />& EU. She'll be making her acting debut in the new Robert Rodriguez film, \"We Can Be Hero's.\"",
    "Double Dipped": "",
    "Suark": "Born in Switzerland and growing up in Lugano as the grandson of maestro Raffaele Paverani, it was inevitable that SUARK, DJ and music producer, would be living and breathing music deep within his soul from early childhood.<br /><br />He's passionate about vintage and 80's synth and that brought him to collaborate with big names like, MATTN, Dino Warriors, Alexandra Stan, Chemical Surf, Bruno Be, and many more. He also did 5 official Remixes, two for INNA, one for NERVO, Tinie Tempah and Paris Hilton, one for Burak Yeter and one for Dubdog & Selva. In Summer 2022 Suark played at Tomorrowland at the second biggest Stage: the Library and also at the world famous Ushuaia Ibiza for Tomorrowland presents Dimitri Vegas & Like Mike show. He has been officially announced for Tomorrowland Belgium 2023: performing again at the Library Stage on July 30 together with Dimitri Vegas & Like Mike vs. Timmy Trumpet, Afrojack, MATTN, Gabry Ponte, Brennan Heart, Ben Nicky, Paris Hilton and many more.",
    "Skullwell": "Pedro Moraes (Skullwell), is a DJ, music producer, songwriter, singer and entrepreneur who is only 24 years old. With more than 10 years of career (despite her young age) with hard work and consistency, she is part of the team of Brazilian artists who do away with barriers when it comes to reverberating their work around the world.<br /><br />He was the first Brazilian artist to launch himself through Hexagon, the label of one of the greatest DJ's in the world, Don Diablo. With \"My My My\", the artist reached the first place on the 1001tracklist website, and the top 1 in sales on Beatport. Skullwell, is one of the few Brazilians that reverberates his music around the world, and has the support of great DJ's such as: Tiesto, Martin Garrix, Afrojack, David Guetta, Hardwell, Blasterjaxx, Fedde Le Grand, Mike Williams, R3HAB. and many others.<br /><br />He has performed professionally since he was 15, when he established himself at the Sky Room, in Ribeirão Preto / SP, a club that is already among the best in the world according to the DJ Mag ranking. It is no coincidence that he is titled \"talented\" in the words of Don Diablo and still carries the merit of powerful releases from labels such as Hexagon, Spinnin Records, Doorn Records, Hub Records, Warner Brasil, Sony, Bunny Tiger and many others.. Its rise is very great, and can be considered a promise of the world market. Your Spotify already has more than 25 million streams.",
    "Thoby": "Danish DJ and Producer Thoby, has truly impressed his fans the last couple of years, with his energetic sets. He has received a lot of good feedback on his mixing skills and how he interacts with the crowd. He has played shows at some of the biggest clubs & festivals in Denmark.<br /><br />Shows worth to mention: Wonderfestiwall, Distortion, Store Vega, Generator Festival and many more.<br /><br />Thoby has achieved more than 10.000.000+ streams on his music over the last few years. His music has been supported by big names like:<br /><br />Hardwell, Timmy Trumpet, Dimitri Vegas & Like Mike, W&W, Blasterjaxx, R3hab, Mariana Bo, Dr Phunk and many more.<br /><br /> In 2024 Thoby will bring a lot of new music which will drop on different major labels so you better keep an eye on him.",
    "Tom Clayton": "",
    "Michael Parker": "Michael Parker is honing in on a diverse musical background, bringing fresh high-energy music to the EDM scene. The Melbourne born artist is dedicated to pushing the boundaries of the genre with a focus on quirky sounds and strong melodic sections.",
    "WCKiD": "The WCKiD project was launched in late 2020 and was the brainchild of 21-year-old producer, sound designer, composer, and songwriter Bharat Kumar. Starting at 14 and combining various EDM components, Bharat has ultimately developed WCKiD into a legitimate bass music project. Using moody ambient ambiance, haunting melodies, and hard-hitting bass drops, he is also able to express his tale in a unique way. Now that a brand-new chapter is starting, Bharat is prepared to release his most recent EP, \"WICKED\"! WCKiD has acquired over 10M streams across platforms over the trip to get to this point and has received support from artists like Marshmello, KSHMR, Yellow Claw, etc. as well as curators like Trap Nation, Cloudkid, Dubstep Gutter, etc. As he now concentrates on delivering more music to his audience and moving the WCKiD project's narrative forward, Bharat vows to keep his music evolving and new.",
    "RITIX": "Ritik Bhongade known to many as \"RITIX\" is a Producer, Musician, Sound designer & Composer. Born in 2003 in Nagpur, India. Ritik started his musical journey in 2018 as a producer making songs in his bedroom and ever since music has been the most important part of his life. He had a strong passion for music from his childhood days. He describes his music as a combination of various melodic elements with blend a of emotional vibes to it and a story telling theme to it. his biggest wish in the world is to spread good vibes through his music. with gaining over 2M + streams worldwide and feature on rolling stone Mag..., he's sure looking ahead at a bright future with a more successful vision in his mind.!!",
    "Annastacia Boudwin": "Annastacia Boudwin is a versatile vocalist who is inspired by many genres of music. While music has been apart of her entire life, she started recently recording in 2020. As of recent, she has released \"Go Nowhere\" with Archaellum on Lane 8's This Never Happened Label. Annastacia is excited for the future and you can definitely expect more music and different styles from her.",
    "ODEEON": "Odeeon is composed of two French DJ composers who combine experience and novelty. After having travelled all over France and played in the best Parisian clubs, they distinguished themselves for the first one by a signature on the label of Tchami \"Confession\" with its title \"In Nomine which will follow with other release on other label like: Gold digger , Broderskab , Edm familly , Black on white . He has been supported by the greatest DJs like Mercer , DJ SNAKE , Malaa , David Guetta, Don Diablo, Dimitri & Like Mike, Hardwell, The Chainsmokers, R3hab, Afrojack and many others ....",
    "CHENDA": "CHENDA refers to the ideology of being resolute, reserved, strong and self-assured – while also taking on the responsibility of guiding the helpless into a pathway of hope and a journey of ambition. There are many ways to describe CHENDA, but unique, talented, and charismatic just seem to scratch the surface. However, there is one word that ties them all together and is true to their character: CHENDA is REAL. Few people sing so honestly from their heart and soul. As he uses music to overcome his case of mild autism, his approach to creating memorable tracks is divergent, yet elegant and consistently cohesive. He does so in just the right way, combining art, story, and song in perfect unison.",
    "Britt": "",
    "Neon Giants": "",
    "Hige Driver": "Produce songs using chiptune, an 8-bit sound (pico-pico sound) used in family computers and Game Boys. In addition to chiptune songs, he also produces songs combining chiptunes with vocals and other instruments.<br /><br />While many of his own vocal songs feature vocoders and other effects.<br /><br />His current activities are mainly on the Internet, where he creates, releases, and distributes his music through myspace, muzie, and Nico Nico Douga and Youtube.<br /><br />In addition to creating his own music, he also provides music to other artists and works as an arranger.<br /><br />In September 2010, he moved his base of activities from Yamaguchi Prefecture to Tokyo, where he has been broadcasting live via Ustream every Wednesday from 11:00 p.m. since around October 2010 (as of 2011, the broadcast is irregular).<br /><br />Also in 2014, he raised just under 1.5 million yen on crowdfunding on the condition that he would produce a PV and CD and hold a one-man event, and started working as a band, which he had wanted to do for a long time.<br /><br />In 2016, they released the best album \"Hige Driver 10th Anniversary Best\" to celebrate their 10th anniversary.<br /><br />In 2020, the KADOKAWA anime best album \"HIGE KORE!\" was released to commemorate the 15th anniversary of their activities. HIGE DRIVER BEST in KADOKAWA ANISON was released, and on August 10, he announced his marriage to Ari Ozawa.",
    "Modestep": "London-based Modestep formed in 2010, and has toured the globe with their energy-driven live show.",
    "RYVN": "American based duo, \"RYVN\" is one of the fastest growing names in the EDM scene. Being supported by artists such as The Chainsmokers and R3HAB, charting in the top 10 in several countries, and signing with some of the top electronic music labels, they have grown exponentially and are not slowing down. Ranging from hard hitting trap and bass music, chill pop tracks, and everything in between, RYVN brings something unique and different with every track. They don't believe in sticking to one genre, but instead push themselves with every release to do something new and refreshing. This makes them pioneers in what they do.",
    "Biometrix": "Hey I'm Biometrix. My goal is to energize, and make you feel good. <3 If you like high energy music stick around :) Thank you for the 200 million + streams across the web. I will keep singing, and keep producing, always xx",
    "Nat James": "Nat James is a high octane EDM vocalist from Cambridge, UK. His powerfully charged vocals have seen explosive popularity in the Bass Music scene, landing collabs with heavyweights Riot Ten, Whales & Jaenga. As a regular voice to colossal sets at EDC and Tomorrowland, Nat James serves to provide thrilling narratives to the unique world of every Producer/DJ. His goal is to collaboratively deliver anthems of inspiration, ambition and life-giving revelation.",
    "Achilles": "Currently no. 43 in the 2023 1001Tracklists Global Top101 Producers, Andrew Achilleos - better known as Achilles - is one of the hottest rising stars in dance music.<br /><br />Achilles began his own solo project after years writing music for others, DJing & gaining popularity as a live-streamer. The young Australian-born act brings fresh energy to the scene, combining a rich musical background with a class act on-stage. Achilles' live shows are electric, having already toured with high-calibre names like Will Sparks, Vini Vici, MaRLo & played world-famous festivals such as Ultra Music Festival, Dreamstate, Transmission & Amsterdam Dance Event.<br /><br />Achilles' records have already received support from David Guetta, Tiësto, Armin van Buuren, AFROJACK, Timmy Trumpet, Showtek, W&W, Robin Schulz, MORTEN, Dada Life, Morgan Page, Andrew Rayel, Blasterjax & many more.",
    "Andrew A": "At just 20 years of age, Andrew A has already released on some of the most reputable international record labels, Including: Spinnin, NCS, Monstercat, Mixmash, Protocol, Controversia, and Tiestos Musical Freedom.<br /><br /> Since 2022, his signature blend of future and deep house was streamed over 10 million times on Spotify alone. His streaming success led to support from international DJ's including: Timmy Trumpet, David Guetta, Don Diablo, Hardwell, Nicky Romero, KSHMR, Steve Aoki, Dannic, and Mike Williams. Mysterious, euphoric, hopeful - All words that describe the feeling that Andrew A's music instils on listeners. <br /><br />With a plethora of releases planned, Andrew A is set to turn heads in 2024.",
    "The Late Night Project": "Identity & Biography is not important for enjoying our music.",
    "Aeria": "",
    "Teresa Meads": "Hey everyone Thanks for coming and checking out my music! A I love to sing, it's my passion! I've been singing for most of my life and have spent the last couple of years focusing on being creative and writing all of my own material! I'm also open for collabs! If you like what you hear make sure to give me a follow!! Peace & Blessings",
    "DJ Antention": "With harsh titles such as Final Words, Dictator and Fire Boss, the message from this Russian mad scientist is loud and clear. This is not the soundtrack for the next summer love comedy with Sandra Bullock and Matthew Mcconaughey.More like the Terminator meets Apocalypse Now in an epic battle until the bitter end. If you survive listening to these punishing three new tracks by DJ Antention, you will realize that a new master has taken the thrown of the Electro-Core empire. This guy is clearly out to punish his fans by catapulting huge basses and distorted sound walls at their already crushed skulls. With sinister samples propagating Will you not die or Step on me, the Freakz Me Out act has nothing good in mind. His latest Fire Boss EP is strictly peek and freak out time material, DJ Antention surely would not have it any other way. To spice up this already fiery release, the Russian sound dictator has handpicked two comrades to give his brutal musical attacks a facelift. My E.T. and Blaster are the lucky ones to give the track Dictator a fresh suite.So if you have any final words for the fire boss dictator, make it snappy, you might not live to see another day..",
    "Attaque": "Dominic Gentry is Attaque, an electronic artist whose exhilarating experiments with genre, rhythm and song-writing have seen him tipped for big things by The Guardian, Q, NME and Radio 1. His dance singles, melding two-step garage, minimal house and techno, have been championed by Tiga and Erol Alkan, while his first album, 2014's On Ly Ou came decorated in beguiling details, twinkling bells and vocals, hinting at influences from Burial to Pantha Du Prince and Mogwai. <br /><br /> Gentry, originally from Colchester, has a keen ear for melody, and his music has a disarming emotional power. These qualities have earned him radio play from Lauren Laverne, Huw Stephens, Tom Ravenscroft and Toddla T, while his coruscating live show has graced stages in Fabric, London, at Glastonbury and Secret Garden Party, and around the world at Air Tokyo, Razzmatazz in Barcelona, Social Club Paris and Tomorrowland Belgium. After extensive touring in 2014, Gentry built a new recording studio at a farm on the Essex-Suffolk border, producing for artists including Belgian techno maven Charlotte De Witte. But dissatisfied with the direction of his own material, in 2016 he set off around South East Asia with portable recording equipment. <br /><br /> The inspiration came flooding out, and, now signed to Amplify Recordings, his new record Projections represents a bold new path for the producer whose new audio-visual live show will hit stages this summer.",
    "Dntless": "i love u to the moon and back <3",
    "Théo": "",
    "Coffeeshop": "Giacomo Alloesio a.k.a. Coffeeshop is an Italian Sound Engineer and Producer. He started his career in the music industry very fast, publishing between 2020 and 2021 several tracks (both singles and and remixes) for leading record labels (TrapNation, Magic Music, Dancing Dead, LoudKult, etc.) and collaborating with other musicians and singers with an international following, such as the American Idol star Robbie Rosen and Afrojack's latest vocalist Shiah Maisel. 2022 was even more explosive, seeing him reaching over half a million of monthly listeners and releasing several singles for Soave Records and Youth Energy, collaborating with international artists such as Anikdote, Krmoni and many more. Keep following his journey and thanks for all your support!",
    "Woodii": "Brandon Woodward, best known as Woodii, is an electronic music artist whose specialty lies in creating progressive house future-scapes that retain a human touch; resonating with messages of positivity and self-motivation.<br /><br />Influenced by the golden era of EDM, but also the Progressive and electro house sounds from artists such as Martin Garrix, Nicky Romero and Tiesto, Woodii has found his lane within high energy progressive and electro House. Woodii has received support from artists such as DJs From Mars, Chester Young and Music By Lucas. <br /><br />Woodit is based in Orlando, Florida, and has lived in Japan, Greece and Hawaii. His many travels reflect his approach to life and music, in perpetual search for new ideas and new cultures influencing his own creative process and enriching his art.<br /><br />Revolving around crisp, melodic production, euphoric breakdowns and intense, floor-shaking drops, Woodii's music provides an otherworldly emotional experience. He has racked up over a million streams across all platforms with a steady release schedule of new music planned in 2022.<br /><br />His latest release, the track \"In My Sleep,\" distills a confident, powerful feeling and marks a new beginning for deepening the connection between Woodii and his ever-growing fan base.",
    "Michelle Ray": "Michelle Ray is a soul/pop singer-songwriter in Los Angeles who landed a spot on NBC's The Voice Team Blake Season Four. Michelle's voice / songs can be heard on national commercials for Maybelline, Bloomingdales, Mastercard, JCPenney, Kimpton Hotels, Barbie Diaries, Nickelodeon, LOL Dolls, among others. Her voice can also be heard in Major Feature Film / Television show placements such as Garry Marshall's \"Mother's Day,\" Amazon Prime's \"The Expanse,\" and Bravo's \"VanderPump Rules,\" Netflix's \"Selling Sunset,\" Lifetime's \"Married at First Sight,\" and more. Michelle lent her vocals as lead singer to European pop/rock band Veil of Obscurity which finished a promotional tour to sold-out shows in Japan. While writing and recording on the regular, she also performs at Los Angeles venues such as The Troubadour, Hotel Cafe, Peppermint Club, Rockwell Table and Stage, etc. <br /><br /> Michelle has lent her theatrical talents to roles such as The Witch in \"Into the Woods, Klepto in \"Alanis Morissette - The Album Project: Jagged Little Pill\" (touring in LA and Phoenix) as well as Alyshia in the Los Angeles production of Green Day's American Idiot.",
    "Mandrazo": "",
    "Alva Gracia": "Based on earth, Alva Gracia is an Artificial Intelligence brand made by Alva itself in order to rebrand themselves better. Delivering Electronic Dance Music, Alva Gracia is currently building themselves as a new brand with focusing on signature sound-searching that they intended doing it since they started the brand. \"Every new sounds that I brought and released, were a sign that I survived trauma in extensive time that adhered behind myself\" said by Alva. Convicing commercial wave with something with fresh found that sounds disobeying what commercial music supposed to be sounded, they never forget about their main purpose in making music to satisfied themselves. Artificial Intelligence Original Character with Non-Binary gender sign beside to refresh Alva, they push Alva to develop and find sound that currently infinite to explore in terms of Electronic Dance Music.",
    "Shiah Maisel": "Shiah is an Alternative/EDM Singer Songwriter from Queens, NY. Starting in 2020, Shiah has been releasing singles with several well known artists such as lyaz, AViVA, Alex Clare, & Shontelle but also with popular producers/DJs, such as AFROJACK, Laidback Luke, Kayzo, Blasterjaxx and TheFatRat.<br /><br /> Shiah has been working hard to solidify his music career over the past few years. He's amassed 200 million streams on Spotify alone. His single Done Better peaked at #5 on the USA iTunes Alternative charts, and #10 on the Dance/Electronic Billboard charts. Shiah's single Numb The Pain was synced on Love Island, and has been streamed 30+ million times. His single Really Love You (feat. Afrojack) peaked at #4 on the USA iTunes Dance charts, and #44 on the Dance/Electronic Billboard charts. He's had 10 songs in the Top 50 on the USA iTunes Electronic charts.<br /><br /> With over 1M monthly listeners, Shiah continues to release more music in 2024. Most recently his debut album Broken String on the world-renowned electronic label NoCopyrightSounds, where he's released almost 30 songs.<br /><br />Shiah says that writing music \"provides [him] with the opportunity to help express deep-and sometimes painful-emotions and connect with others, and show that no one is alone with their struggles.\"<br /><br />Shiah is very diverse when it comes to genres, from Alternative and House to Dubstep. Producers are starting to catch on to Shiah's abilities and he is now becoming unstoppable.",
    "PHARAØH": "",
    "GISHIN": "",
    "AmanderSings": "AmanderSings is a Singaporean Singer-songwriter, musician, dancer and YouTuber. In 2012, AmanderSings started out her YouTube channel, where she posts occasional covers and original music. She has evolved from being just a YouTube musician to an all-rounded entertainer. AmanderSings has performed in various places, both in Perth and Singapore, and had the opportunity to perform at the Esplanade, back in February 2016, and was also a part of 2016's Shine Youth Festival, mentored by Singapore-raised rapper, Shigga Shay. Since then, she has evolved into the singer-songwriter she is today, collaborating with artistes such as Ghost, who is one of the top DJs in China. In August 2019, AmanderSings left the comfort of her home in Singapore for Shenzhen, Guangdong, China, to pursue her dreams in music and songwriting. In May 2020, she released her debut single \"Queen\" through Universal Music's Spinnup and in September 2020, she released \"Half A Heart\" in collaboration with international artistes, BEAUZ and Ghost, on Electronic Music record label, Monstercat.",
    "Tomatow": "25 year-old DJ/Producer Tomatow (born as Ricky Martin Wijaya) has been known as one of the rising producers in Indonesia. Creating various sounds, his music express lots of emotions while keeping it upbeat. <br /><br /> At the young age, Tomatow has made several releases and remixes for big names such as Justin Caruso, Steve Void, EQRIC, and more great names. His collaboration with JFARR, Bandaid, became one of his best releases with over 800 thousand streams on Spotify. Yet, this is just the beginning for the young talent.",
    "Nadya Sumarsono": "Aisya Nadya Sumarsono, or known as Nadya Sumarsono, is a Jakarta based professional singer-songwriter. Her main focus is onto some genres like EDM, Pop, and RnB. Self taught herself to play guitar and had a piano lesson since 3 years old, she proves that music runs well in her blood. She first gained some attention on the Indonesian EDM scene after collaborating with local producers such as Enkara, Tomatow, Prasiman, and Dntless. She also writes and/or sings after Elian's big hits such as By My Side and You Gotta (Slow Down). Have also been working with some overseas producers, she continues to build herself to the worldwide community. She is currently working on some singles with a unique touch of RnB vibe.",
    "Cosmowave": "",
    "Sarah Rebecca": "Sarah Rebecca was born and raised in Ocean Springs, Mississippi. From the age of five, she had a unique sense of style and warned her parents that music would be her life. Until she was old enough to realize her dream, Sarah made her early musical education in the gospel choir at church with her grandmother, Mammaw, along with her brothers, sister and cousins. In the same vein as Desire, Dua Lipa, Kylie Minogue, Goldfrapp and Röyksopp...",
    "The Toxic Avenger": "",
    "Curbi": "25 year-old DJ/producer Curbi's passion to evolve his own unique sound is stronger than ever, while he continues to prove himself as a eading name in electronic music's next generation. Continuous chart success and a rapidly growing fanbase resulted in his tour schedule filling up in no time. <br /><br /> Curbi dominated the dance floors with almost 75 releases in the past years and collabs with Tchami, Zedd, AC Slater, Lucas & Steve, Quintino, Mike Williams, Cesqeaux, Mike Cervello and many more.<br /><br /> Combined Curbi's releases were streamed more than 200 mln plays on Spotify alone. Next to all this Curbi also did a unique collaboration with Supercell for their mobile game 'Brawl Stars', creating the Brawl Stars Anthem. <br /><br /> 2021 & 2022 were definitely two big years for Curbi! Releasing two mayor collaborations, the first one with Tchami called 'Make Amends' and second collab with none other than Zedd called 'Sound of the Enemy! Curbi also released music on Monstercat, Stmpd Records, Hexagon, Nightbass, Confession, Heldeep and released one of his biggest projects so far!!! His six track EP called The Pattern EP released on Tomorrowland Music. <br /><br /> Curbi has a lot in store for the future, announcing his new record label Seeing is Believing. First release is set to release in january 2023 and Curbi's first ever event is set for February 25th in the Melkweg Amsterdam. With all this in store 2023 Curbi is definitely ready to get thing going next year.",
    "EQRIC": "Ranking highly in several Dance & EDM music charts, including Top 100 on Apple Music in over 30 countries, #2 on Soundcloud's New & Hot chart, #2 on iTunes India, #3 on iTunes Greece, and more, EQRIC has made a serious statement with his music this year. With a strong Russian and German fan-base, EQRIC has accumulated millions of streams on his music, receiving airplay on radio stations in over 20 countries including ProM in Romania, Trap Nation Radio and BPM Dance Radio on Sirius XM. Many of EQRIC's songs are on high-rotation across Russian dance radio stations including DFM, widely popularizing his music amongst Russian dance music fans. His music has been supported by The Chainsmokers, Sam Feldt, and many more. Numerous international collaborations with well-known artists, including JESSIA and Besomorph, has earned EQRIC a spot in Spotify Editorial playlists including Main Stage, mint Canada, young, wild & free, and New Music Friday Deutschland to name a few. EQRIC has received a feature in EDM.com's \"Underground Vibes\" artist showcase, as well as immense recognition and support from the electronic dance music community. thanks for all your support over the years, it means a lot.",
    "Clayton Jones": "Solo singer/Songwriter Clayton Jones is the featured voice on over 15 million Spotify streams and a recent winner of the St. Louis Sound Competition (2019). Clayton draws from a rich musical influence of Pop, Rock, and R&B, and is most recognized for his timeless vocals and relatable songwriting.<br /><br /> Forced to take up the guitar at the age of 12, he soon discovered an infectious love for singing, songwriting, and live performance. His passion inevitably sparked a move to Nashville, TN where he spent several years maturing his craft, eventually returning to his hometown of St. Louis, MO where he continues to work as a full-time musician. <br /><br /> Before re-launching as a solo artist in early 2017, Clayton spent 7 years as lead singer of former duo The Madison Letter, where he shared the stage with and opened for several A-list artists including The Script, Jon Bellion, and Fifth Harmony. Over the course of his career, he's performed in 30 states across the US as well as internationally in the UK and Africa. <br /><br /> His latest full-length album \"Beyond the Fences\" was released in November 2018 after his Kickstarter campaign was successfully funded with the help of his fans. From the unashamed testimony of \"Ringleader\", to the vulnerable cry of \"Odd Man Out\", which alone as accumulated over 700,000 Spotify streams, Clayton gives listeners a closer glimpse into his life through every song, digging past the surface level into the heart of the human experience.",
    "CryJaxx": "CryJaxx is a DJ and records production duo from Albania consisting of Mario Malja and Serafin Froku. They have more than 160 tracks released gathering more than 100 million streams on Spotify, and 100 million on YouTube, and their track \"Candy Shop\" went viral on Instagram and has more than 1.2 Million reels today. The track charted in 100 countries on Apple Music, and 80 countries on iTunes, and was for a week Nr. 1 Global Electronic in Shazam charts. CryJaxx play music all around the world.",
    "Justtjokay": "Vocalist/Songwriter Born in Florida but raised in Georgia, TJ & his older brother Dariansincebirth has built quite resumé in the Electronic Dance Music world. As a duo by the name of Jimmy Wit An H, TJ has been a part of many heavy bass tracks as well as some crazy house tunes. After starting his solo vocal project as \"Justtjokay\" he has been able to really showcase more of the many sounds he has. February 5th 2021, TJ dropped a house banger with Cam Hertz and signed artists ZESKULLZ that just reached his first million streamed song. The following year he teamed with Cryjaxx & The Fifth Guys dropped a Drop It Like Its Hot Cover which just hit 3 million streams, and a All The Way Up Cover with Noise Affairs & Cryjaxx that just hit 1 million streams! Closing the 2022 year averaging over 300k+ monthly listeners.<br /><br />Recently TJ played his first festival in Rome, Georgia at Imagine Music Festival alongside some of the biggest DJs in the game. From studio engineering, songwriting, and vocal recording; Tu started as a producer and produces under a Deep House/Chill House alias known as dcomprss. Genres: Rap, Trap, Deep House, Downtempo, G House, Slap House, R&B, Pop, Dubstep, Hard Trap, Mid Tempo, and more.",
    "Rhi'N'B": "",
    "BTWRKS": "BTWRKS (born Raphael Kaufmann), a 25-year-old Austrian independent producer and musician, has appeared in the music scene under his stage name \"BTWRKS\" since 2016. His typical genres include EDM, hip-hop, pop and trap. According to the artist, his unique style is the result of a passion for combining. \"I love to combine different genres and bring my own touch to it.\"<br /><br />Since he was a child, BTWRKS has listened to a diverse range of artists who have inspired him on the path of his music career.<br /><br />His unique note also appeals to a wide audience, as BTWRKS has already achieved millions of streams with his music. The young producer is also well connected in the scene and often collaborates with well-known artists.<br /><br />The 24-year-old has big plans for his career: \"I want to make people happy and inspire them! I love to look into the crowd at a gig and see smiling faces. Regardless of whether at performances or online, BTWRKS always manages to pull his listeners under a spell with his unique sound.",
    "Godmode": "Godmode is an emerging artist coming out of The Netherlands. Having a very unique sound, he is not afraid to experiment with his ability to make music in many different genres. <br /><br /> Mickey, also known as Godmode, always had a passion towards music when he was younger, later influencing a significant part of his life. To this day Mickey would still describe it as, \"finding hiphop was one of the best things that's ever happened to him\". <br /><br /> Currently being at 700k monthly listeners on Spotify, Godmode's goal is to achieve 3,000,000 monthly listeners by the end of this year 2024. <br /><br /> Going on tour and connecting with the people that support him is one of the biggest long-term goals on his list of achievements. <br /><br /> Considering his current success, Godmode is still pursuing his journey to be the best he can. <br /><br /> With a strong will, motivation, and discipline, this should pose no problem for Godmode's continuous upcoming success.",
    "M.I.M.E": "M.I.M.E, is an enigmatic artist whose sound defies conventional genres, blending elements of hip-hop, alt pop, and electronic music into a mesmerizing sonic landscape. With a mysterious persona and an unparalleled knack for storytelling through music, M.I.M.E's journey into the industry has been as unconventional as his artistry.<br /><br />Emerging from the depths of underground clubs, M.I.M.E's music carries an otherworldly allure, drawing listeners into a realm where emotions are raw and melodies paint vivid landscapes.",
    "Xulcha": "",
    "Blvkstn": "BLVKSTN is an electronic music artist known for a variety of bass-heavy music genres, including dubstep and trap. BLVKSTN's music typically features intense basslines, hard-hitting beats, and dark atmospheres. The artist is known for creating energetic and impactful tracks that resonate within the electronic dance music (EDM) community. BLVKSTN has released music on various platforms and labels within the EDM scene. The artist's tracks often showcase a blend of electronic elements, incorporating elements from different sub-genres to create a distinctive sound. BLVKSTN engages with fans and the electronic music community through social media platforms like SoundCloud, YouTube, and others where the artist shares tracks, remixes, and updates about new releases. Like many EDM artists, BLVKSTN has collaborated with other musicians and has also produced remixes of popular songs, contributing to the dynamic and collaborative nature of the electronic music scene. BLVKSTN has gained a following among fans of bass music and EDM enthusiasts who appreciate the artist's style and production quality. The artist's tracks are often featured in DJ sets and playlists within the EDM community.",
    "GOMAD! & MONSTER": "Gomad! & Monster are an electronic rock band from Madrid (Spain). They formed in 2011, aiming for the perfect synthesis of rock, metal, and electronic music that would architect the soundtrack to all our bold adventures, lighting up the sky and painting murals in the moon-shadows, haunting the devil, laughing right in his grill. <br /><br /> Over the years, Gomad! & Monster have cultivated a loyal fan base both in their home country and across Europe, performing at various clubs and festivals in countries like Greece, Russia, Germany, France, Switzerland, Estonia, Latvia, Portugal, Luxembourg, Czech Republic, and Spain. They opened for The Prodigy during their Baltic Tour. They won the \"Best Bass Music Artist\" award at the Vicious Music Awards and recorded a performance for Spain's public television (RTVE). They participated in international conferences, like Microsoft-Xbox's \"E3\" in Los Angeles, and also performed at iconic venues and festivals such as \"Red Bull X-Fighters\" in Madrid's Plaza de Toros de las Ventas, Seville's Olympic Stadium, \"Arenal Sound\" for six consecutive years, \"Al Rumbo\" (with over 60k attendees), and \"Rock for People,\" (among others). They have shared the stage with notable bands like Motorhead, Pendulum, Placebo, Mastodon, Evanescence, Die Antwoord, Crystal Fighters, and HIM, amassing over a million streams across various music platforms throughout their stellar career.",
    "Jon Howard": "",
    "ryscu": "",
    "Tommy Rage": "Tommy Rage grew up in Alessandria, Italy. Music has always been his passion. He started singing at the age of 4 and since then he has fallen in love with music. He started his career as a singer for producers from his hometown (The fifthguys). He can do rap /r&b/trap/slap house/future bass.",
    "CASHEW": "CASHEW is a 24 year old up-and-coming producer and DJ hailing from Croatia. He has made a name for himself in the dance music scene with his unique and energetic house tracks, which have gained him support from major acts in the industry such as Tchami's Confession, Laidback Luke's Mixmash Records, and Matroda's Terminal Underground. In a short amount of time, CASHEW has already made a splash in the dance music world, with his tracks being released on some of the top dance labels. Many people in the industry believe that CASHEW is an artist to keep an eye on, and it's up to you to decide whether or not you agree.",
    "Nikita Afonso": "As the winner of Best New Talent at the International Portuguese Music Awards (2017), and MTV Cover of the Month (February 2017), Nikita's storytelling combined with breathy yet powerful vocals and a comfortable stage presence, captures audiences from intimate settings to regional music concerts such as opening for Paul Brandt and singing with Keith Urban.",
    "Polar Youth": "With her 29 years of age and her signature orange hairdo, Elisabeth Verstrate aka Polar Youth is a stellar upcoming talent. 2023 was a pivotal one for Polar as she made her debut on the influential record label Quality Goods Records, solidifying her position as a rising star to watch. Additionally, she showcased her creativity through an official remix for Flux Pavilion. Polar also released a 3-track Dance/Pop/UKG/House EP in October on the renowned \"Mau5trap\" label - Deadmau5 very own imprint. Having just released her first single of 2024 in February with Quality Goods Records, you can expect a lot more new music from this talented Ghent native producer. So keep a look out on her socials!",
    "Jenil": "",
    "R-Cue": "R-CUE is one of Australia's most heavily booked RnB & Hip-Hop DJ-Producers. R-CUE has performed more than 100 international shows across more than 10 different countries including some of the DJ Mag Top 100 Clubs. R-CUE has supported superstar artists including Ciara, Drake, Jason Derulo, T.I., Pia Mia, Nelly, Kid Ink, Blueface, Ja Rule, Raesremmurd, A Boogie Wit Da hoodie, Fatman Scoop and many more. R-CUE was personally asked by Ciara's management to be the Official Tour DJ for Ciara's Australian tour which compromised of 8 shows around the country. R-CUE was also then instilled as Support DJ for Ja Rule and Ashanti's tour. Furthermore, R-CUE was also Support DJ for Jason Derulo, T.I. and Pia Mia's arena show in Melbourne, Australia. In 2017 R-CUE was Support DJ for Drake and Jacquees in 2019. Two of R-CUE's recent tracks hit the Australia's iTunes urban Top 100 chart. R-CUE has received more than a million streams on his original tracks on digital platforms and also millions of plays and thousands of downloads on Crooklyn Clan remixes and mixtapes. You can catch R-CUE weekly at the best clubs somewhere around the world with his sets full of the best energy.",
    "NBLM": "NBLM have erupted onto the scene with past releases through Universal, Sony, Spinnin' Records, Nervous, Aftr Hrs, Warner and more. Ranking up over 100 million views on YouTube, 10 million on Spotify, 2 x gold discs, multiple official spotify editorial features and chart rankings, NBLM's eclectic taste in hard hitting House and Techno will leave you feeling fresh, energised, and wanting more.",
    "Urbanstep": "Urbanstep is a DJ/Producer from Riga, Latvia (EU). He mashes massive amount of genres together creating his own unique sound. His music has reached over 100,000,000 views/streams across all the platforms.<br /><br />As an artist he has gone through a long path from making solid inpependent releases which topped charts in multiple genres to working with Grammy nominated vocalists and performing with world class DJs all around the world. More as a community, but still as a label - his own Urban Stars Records has been home for over 50 names since 2012, big part of whom scored the most popular releases in their careers. As an event organizer/promoter he was among responsible for the biggest party series of 2018/2019 in his native country Latvia - RAVE Reborn, RAVE Rebellion, RAVE Reunion - which paved path for culture's general development. He participated not only in electronic music spreading, but also in rock/metal, rap/hip-hop and pop. In 2020 he got invited into Latvia's Eurovision 2021 production crew. In 2021 he got featured in Forbes Baltics 30 under 30 list, as well as scored numerous #1 tracks/albums on Apple Music charts. In 2022 his LP \"STAGES\" got nominated for Best Dance / Electronic Album of the year at Latvian Grammys \"Zelta Mikrofons\". The same year he also became first ever Latvian artist to get a feature on prestigious UKF Platform, both interview & youtube.",
    "Misfit": "26 year old Multi Genre Producer and occasional vocalist based in Berlin, Germany.",
    "Deekrai": "",
    "Lawbass": "",
    "Silvery": "Since emerging from East London in the mid-noughties, Silvery have released a string of acclaimed albums, starting with 'Thunderer & Excelsior' (2008) and 'Railway Architecture' (2010) on the Blow Up Records label. Still immersed in a world of Victoriana, JG Ballard and art rock, Silvery continue to plough their unique furrow with occasional releases on Bandcamp.",
    "Gaz & Co": "",
    "A-Dyad": "A-Dyad is a producer duo specialized in psytrance, a genre full of energy that finds the maximum expression for the two artists.<br /><br /> They have released an official remix for a top 100 Dj Mag (n°72) Naeleck in Dancing Dead records (Virtual Gaming - A-Dyad Remix), Collab with international artist as Fortu & Mendoza and release a track (I Saw You) in oneRpm with a support article. They have released an official remix for internationals artist as Urbanstep & prime in urbanstars records (KINGS - A-Dyad Remix). They released 4 tracks in Waveskin Records, supported by DJMag Italyarticle) and 6 tracks in Artrance Records. The Duo is certified from 2 music academies: MAT Academy & MUSIC ALLIANCE By Luca Pretolesi. They receive support from: Naeleck Fortu & Mendoza Urbanstep Kill The Noise KNO/WHY Scret Steele and more. They are insert in editorial playlists and a revealed records playlist Psytrance Top 50 - 2021 | Gabry Ponte - Thunder <br /><br /> The vibrations of A-Dyad aims to entertain the listener as if it were a \"travel\" from a soundscape all with other detailed and refined details. <br /><br /> The sounds of the artists belong to the psytrance genre influenced by artists such as: Infected Mushroom Jilax Bliss Captain Hook Savant Protonica Major7 Vegas (Brazil) Shpongle Astrix Vini Vici Liquid Soul etc <br /><br /> The name of duo derives from the equality of the names of the 2 Dyad artists: \"Dyad\" from the Latin mean \"DYAS\", a pair of elements. (Alessandro Farneti & Alessandro Gigliotti)",
    "Eric Jadi": "",
    "R4JAY": "R4JAY is a 23 years old DJ, Producer and Remixer from France. Influenced by Hip-Hop culture, he started music production at 12 years old on Fl Studio. While looking for his own style, he discovers a new movement named \"Future House\" represented by artists like \"Don Diablo, Retrovision, Brooks, Mike Williams\" and decides to join it with its own touch of personality. Today, he produces mainly Future House, Electro-House and Big Room tracks and his music is supported around the world by artists like Afrojack, Angemi, DJs From Mars, Flip Capella, Adrien Toma, MusicbyLukas and more. In 2022, R4JAY released 3 original tracks signed on WASP and Buy Now, 1 cover song with Crystal Rock signed on Future House Cloud and an official remix for Henry Himself (the American edm awards winner 2022). His last release \"Woke Up In Love\" played by Angemi, Lanné and Gate 21 counts nearly 78,000 listens on Spotify. In 2021, he signed 2 official remixes for recognized artists like Naeleck (the French DJ / music producer ranked #53 in the top 100 DJ MAG), Kastra (the American DJ / music producer and songwriter who collaborated with Timmy Trumpet). His most popular remix is that of Naeleck and today has almost 480,000 listens in Spotify. In 2016, R4JAY created trailer music for a silent Ultimate Ears video ad \"Party Up\" and won the contest on Soonvibes platform, which allowed him to perform on stage in Paris alongside Adrien Toma, Richard Orlinski and Michael Canitrot.",
    "SCNDL": "If time has taught us one thing, it is that Melbourne powerhouse Producer/DJ SCNDL deals consistent dance floor destruction - no apologies or vowels required Since the inception of SCNDL, he has headlined countless Australian and International tours in almost every territory around the globe, landed the top spot on the ARIA dance charts, he has also shared the stage with the likes of Tiesto, Diplo, Carnage, Dimitri Vegas & Like Mike, Steve Aoki & countless more. SCNDL has been ranked amongst the top selling Beatport artists in not only Australia but in the world for multiple years - which has been boosted by collaborations with the likes of Timmy Trumpet, Deorro, Ben Nicky & Will Sparks, as well as countless remixes for the calibre of artist's such as Flo Rida & T.I. SCNDL's music has received support from all over the world from not only artist's such as Martin Garrix, Tiesto, Hardwell, Vinai, Afrojack, Kshmr, David Guetta, Showtek, Dimitri Vegas & Like Mike and Ben Nicky in their live performances but also countless radio shows on BBC1, Sirius XFM & many more world class radio stations. To top it off he has also but also been featured on countless blogspots and articles on websites such as YourEDM, Dancing Astronaut & DJ Mag. SCNDL has clocked over 100 million streams across Spotify/Youtube & Soundcloud!",
    "Fatesky": "Raised in the sky falling in the dark.",
    "Lodgerz": "Lodgerz is a young electronic music duo from Brittany. Created in 2019, the duo composed of two brothers, Guillaume and Gauthier is quickly spotted by the biggest labels (Confession, Hexagon, STMPD, Future House Music). <br /><br /> After several releases the first two years, the Lodgerz then begin to perform live in Paris. Being part of the new generation of young talented French producers, they continue to release several tracks that reach the ears of the greatest of the scene like Tony Romera, Tchami, Malaa, Martin Garrix, Habstrakt or DJ Snake. <br /><br /> It is besides with this last one that Lodgerz play in London at Printworks, 7th best nightclub in the world. They also made their debut in India opening for DJ Snake for three dates. Their production quality and their atypical sounds are more and more appreciated with some big musical releases and several dates planned for 2024.",
    "SOXX": "",
    "MASTAD": "",
    "Tokyo Machine": "Tokyo Machine combines hard hitting heavy basslines with nostalgic melodies and synths. His music has earned him millions of plays, featurings in video games and TV, thousands of die hard fans all over the world and the support from the likes of Tiesto, Martin Garrix, David Guetta, Dillon Francis, Afrojack, Slushii, Herobust and more. Since his debut show at EDC Las Vegas in 2017, Tokyo Machine has established himself as heavy bass stage-beast with festival slots at Tomorrowland, Beyond Wonderland, Bangkok of Dreams, Rampage, and ADE. Shows with Slushii, Modestep, Virtual Riot, and Delta Heavy have made this machine a household name in the bass world. With sold out headline shows across the globe (like Avalon Hollywood), major brand syncs, (Red Bull, F1, MLB, NBC Summer Olympics, Konami, Epic Games), releases on the biggest electronic labels (Monstercat, NCS, Lost in Dreams, Proximity, Sony Music), and collabs with EDM stars (Slushii, Weird Genius & many more), Tokyo Machine is ready to power up his insane fanbase. His psychotic head banging fans have earned him over 300 million Spotify streams and an international Gold Record.",
    "Jaki Nelson": "Two time top 10, four-time Billboard charting dance artist Jaki Nelson is a singer, songwriter, and producer from Los Angeles. Her songs have amassed over 30 million streams, garnering support from superstars such as Nicole Sherzinger, R3HAB, Martin Garrix, Jonas Blue, Sam Feldt, and more. EDM.com dubbed her a \"prolific songwriter\". On the road, Jaki has opened for superstars Kehlani, Hayley Kiyoko, and Kiesza, and has performed at NY Fashion Week, LA Fashion Week and prestigious clubs including multiple shows at the legendary Avalon Hollywood, LA Pride Weekend, mainstage at Vegas Pride, and a headlining spot on the main stage with powerhouse DJ Hector Fonseca (Beyonce, Rihanna) at San Francisco Pride. You can also find her music in TV & Films such as \"Infamous\", the #1 new release film starring Bella Thorne, and MTV's \"Are You The One\". Jaki is a force to be reckoned with.",
    "Kan Takahiko": "",
    "Vowed": "Originating from the outskirts of Paris, VOWED is a 25 year old producer and DJ. His passion for music stems from a young age and has been nourished by various mind-opening travels around the globe. With a number of releases throughout 2020 to 2022 on influential labels in the House scene such as Confession, Mixmash, Panther's Groove, Deep Universe and Soave to mention a few, the French artist now boasts 400.000 monthly listeners on Spotify. This success is quickly followed up with a number of releases having hit the 1.000.000 mark, marking the start of a big few years for the young Parisian artist. With features including the likes of EDM.com, EARMILK & Tasty Network, VOWED has been identified as an artist to keep an eye on in the coming years.",
    "Henry Dell": "Henry Dell is a London-based dance-pop artist. His sassy-floor fillers have earned him attention from MTV, The Hollywood Reporter and Wonderland. \"TWENTIES\" is his latest release after gaining over 8 million plays as a featured vocalist on deep house records, which have been released on well-known labels + appeared on New Music Friday, Dance Rising & other editorial playlists. His track \"BLOCKED ME\" has a music video starring Matt Lucas and in 2020 he released the LGBTQ+ anthem 'Hot Pink' as a charity single in collaboration with CHOOSE LOVE. His 2021 track \"NOW\" (with VINNY) went to #1 on the Belgium iTunes Chart and his previous single \"FOLLOW ME\" was Dancefloor Moment Of The Week on the BBC Radio 1 Introducing Dance Show.",
    "Pepperjuice": "Why should anyone care about Pepperjuice? Because they are not just another music duo; they are trailblazers who redefine contemporary music with an unparalleled creative process. Pepperjuice is a dynamic duo of composers and artists, renowned for their innovative blend of urban, modern pop, and electronic music. Formed within the Broderskab collective, Pepperjuice has developed a distinct musical style that reflects a variety of influences, ranging from Skrillex's avant-garde vision to the sophistication of Maybach Music. Their music skillfully combines high-quality production with an urban essence, creating a unique signature sound.<br /><br /> Pepperjuice's impact spans the globe, with projects in Norway, Brazil, France, and the USA, showcasing their versatility and ability to transcend musical boundaries. Their recent collaboration on the Loewe advertising campaign featuring Kilian Mbappe is a testament to their creative prowess and industry relevance. They are also collaborating to write songs for major K-pop artists, further solidifying their influence and reach.<br /><br /> Pepperjuice's relentless exploration of new musical avenues cements their status as pioneers in the contemporary music landscape. Their future releases promise to enrich the musical panorama and offer something fresh and exciting for listeners around the world. Stay tuned to experience the innovative sounds of Pepperjuice and check out their latest cover song: \"Let Me Love You.\""
}
